app/controllers/password_resets_controller.rb

UPDATE "users" SET "remember_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["remember_digest", "$2a$04$nIBz361LrKuWN.q4kexQ4OcpMF.QyCG85jOcCta8up48rgDOR7iS."], ["updated_at", "2020-07-29 14:27:57.094130"], ["id", 762146111]]
---
  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update(user_params)